---
kind: method
id: M:Autodesk.Revit.DB.OBJImportOptions.#ctor(Autodesk.Revit.DB.OBJImportOptions)
source: html/c22d80b8-c999-95ca-4657-8227a92380a4.htm
---
# Autodesk.Revit.DB.OBJImportOptions.#ctor Method

Constructs a new instance of OBJImportOptions as a copy of the import options.

## Syntax (C#)
```csharp
public OBJImportOptions(
	OBJImportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.OBJImportOptions`) - The OBJ options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null